Terraform plan prod:
```
  # module.stateful.aws_iam_policy.etl_rw_s3 will be created
  + resource "aws_iam_policy" "etl_rw_s3" {
      + arn         = (known after apply)
      + description = "ETL read-write S3 policy"
      + id          = (known after apply)
      + name        = "bfd-prod-etl-rw-s3"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6",
                        ]
                      + Sid      = "ETLRWKMS"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::bfd-prod-etl-577373831711",
                        ]
                      + Sid      = "ETLRWBucketList"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::bfd-prod-etl-577373831711/*",
                        ]
                      + Sid      = "ETLRWBucketActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.stateful.aws_iam_user.etl will be created
  + resource "aws_iam_user" "etl" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bfd-prod-etl"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.stateful.aws_iam_user_policy_attachment.etl_rw_s3 will be created
  + resource "aws_iam_user_policy_attachment" "etl_rw_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "bfd-prod-etl"
    }
```